<?php

	include_once('call_ws.php');
	
	$demo = new yc_sms();
	//发送短信
	//输入参数：用户名；密码；短信内容；目标号码；扩展码（非必须）；发送时间（非必须）
	print_r($demo->sendsms('','','hahaha again',''));	//即刻发送
	//print_r($demo->sendsms('','','hahaha again','','','2013-03-18 14:16:01'));	//定时发送
	
	//按id号查询发送状态
	//输入参数：用户名；密码；查询id；结果集起始值（非必须）；结果集的最大返回条数（非必须）
	//print_r($demo->getStatusById('','','cd4f966a-eba7-4e09-80ff-ff74a6feca8d'));
	
	//按时间查询发送状态
	//输入参数：用户名；密码；查询手机号码（非必须）；开始时间；结束时间；结果集起始值（非必须）；结果集的最大返回条数（非必须）
	//print_r($demo->getStatusByTime('','','','2013-03-01','2013-03-15'));
	
	//按时间查询上行短信
	//输入参数：用户名；密码；查询手机号码（非必须）；查询手机号码（非必须）;扩展码（非必须）开始时间；结束时间；结果集起始值（非必须）；结果集的最大返回条数（非必须）
	//print_r($demo->getReplyByTime('','','','','2013-03-01','2013-03-15'));
	
	
	//余额查询
	//输入参数：用户名；密码
	//print_r($demo->checkBalance('',''));




?>